agiv-security-client/src/test/resources/ip-sts-request-java.xml

<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing"><S:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" S:mustUnderstand="true"><wsu:Timestamp wsu:Id="TS-2"><wsu:Created>2011-12-27T10:16:07.555Z</wsu:Created><wsu:Expires>2011-12-27T10:21:07.555Z</wsu:Expires></wsu:Timestamp><wsse:UsernameToken wsu:Id="UsernameToken-1"><wsse:Username>fcorneli</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">foobar</wsse:Password></wsse:UsernameToken></wsse:Security><a:Action xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">http://docs.oasis-open.org/ws-sx/ws-trust/200512/RST/Issue</a:Action><a:MessageID>urn:uuid:1f211dec-365f-4af0-a9e1-e6219d774d4c</a:MessageID><a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:To xmlns:env="http://www.w3.org/2003/05/soap-envelope" env:mustUnderstand="true">https://beta.auth.vlaanderen.be/ipsts/Services/DaliSecurityTokenServiceConfiguration.svc/IWSTrust13</a:To></S:Header><S:Body><ns3:RequestSecurityToken xmlns:ns3="http://docs.oasis-open.org/ws-sx/ws-trust/200512" xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns4="http://www.w3.org/2005/08/addressing" xmlns:ns5="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:ns6="http://www.w3.org/2000/09/xmldsig#"><ns3:RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</ns3:RequestType><ns3:Entropy><ns3:BinarySecret Type="http://docs.oasis-open.org/ws-sx/ws-trust/200512/Nonce">OC2rvsS4nVr2fC26iToTXojn1r08HvhY70woXsyGI9E=</ns3:BinarySecret></ns3:Entropy><ns3:KeyType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/SymmetricKey</ns3:KeyType><ns3:KeySize>256</ns3:KeySize><ns3:KeyWrapAlgorithm>http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p</ns3:KeyWrapAlgorithm><ns3:EncryptWith>http://www.w3.org/2001/04/xmlenc#aes256-cbc</ns3:EncryptWith><ns3:SignWith>http://www.w3.org/2000/09/xmldsig#hmac-sha1</ns3:SignWith><ns3:CanonicalizationAlgorithm>http://www.w3.org/2001/10/xml-exc-c14n#</ns3:CanonicalizationAlgorithm><ns3:EncryptionAlgorithm>http://www.w3.org/2001/04/xmlenc#aes256-cbc</ns3:EncryptionAlgorithm><ns5:AppliesTo xmlns="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns3="http://www.w3.org/2005/08/addressing"><ns3:EndpointReference><ns3:Address>urn:agiv.be/salvador</ns3:Address></ns3:EndpointReference></ns5:AppliesTo><ns3:ComputedKeyAlgorithm>http://docs.oasis-open.org/ws-sx/ws-trust/200512/CK/PSHA1</ns3:ComputedKeyAlgorithm></ns3:RequestSecurityToken></S:Body></S:Envelope>

